books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-02 Fri 10:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>What I am reading</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">What I am reading</h1>
<p>
My reading feeds this digital garden in a process that starts with <a href="20211126141814-how_i_take_reading_notes.html#ID-a9d4499d-b5f4-4676-8ada-f7a5a5c38681">taking reading notes</a>. I try to read only a few book at the time; the following are currently on my bedside table:
</p>

<ul class="org-ul">
<li>Julian Jackson - De Gaulle</li>
<li>Jacob Goldstein - Money</li>
<li>Daniel Friedman, William Byrd, Oleg Kiselyov &amp; Jason Hermann - The Reasoned Schemer</li>
</ul>

<div id="outline-container-orgebd6d80" class="outline-2">
<h2 id="orgebd6d80">The pile</h2>
<div class="outline-text-2" id="text-orgebd6d80">
<p>
There are <a href="20220215171446-the_reading_pile.html#ID-18bb96ef-f68c-4634-8550-8272c5e6515b">quite a few books waiting to be read</a> in my house. For money that wasn't spent in vain (can't say it was always <i>well</i> spent), see <a href="20220103103303-what_i_have_read.html#ID-911c1ce7-5f95-4047-b724-91cd06761533">what I have read</a>.
</p>
</div>
</div>

<div id="outline-container-orgc36a747" class="outline-2">
<h2 id="orgc36a747">Contribute to my education</h2>
<div class="outline-text-2" id="text-orgc36a747">
<p>
I feel that <a href="20220103103303-what_i_have_read.html#ID-911c1ce7-5f95-4047-b724-91cd06761533">what I have read</a> and the current list is <i>very low variance</i> and I'd appreciate the following kind of suggestions:
</p>

<ul class="org-ul">
<li>(Science)Fiction</li>
<li>Anything with a high vantage point. Think Sapiens, Turchin, etc.</li>
<li>Anything that would stand out if they were in <a href="20220215171446-the_reading_pile.html#ID-18bb96ef-f68c-4634-8550-8272c5e6515b">the reading pile</a> because they have a very different point of view.</li>
</ul>

<p>
Since <a href="20220103103557-it_s_rarely_right_or_wrong.html#ID-f139e256-9a3a-43a9-99d0-03ff7a0c2446">ideas are rarely right or wrong</a>, I am always after a broader perspective.
</p>
</div>
</div>

<div id="outline-container-orgfb6e64b" class="outline-2">
<h2 id="orgfb6e64b">Links to this note</h2>
<div class="outline-text-2" id="text-orgfb6e64b">
<ul class="org-ul">
<li><a href="./now.html">🌿 Now</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>